Catalogs/Фактура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Фактура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлянцеваяПоверхность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобильныйПостроитель_Группа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобильныйПостроитель_Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентРастяженияПоУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентРастяженияПоХ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаПолотна</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФактуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыФактур</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Фактура/Forms/ФормаЗагрузкиИзПостроителя/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПоказыватьВсеСтрокиПриИзменении(Неопределено);
	
	ВыборФайла();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборФайла();

КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьВсеСтрокиПриИзменении(Элемент)
	
	Если ПоказыватьВсеСтроки Тогда		
		Элементы.ТаблицаРезультата.ОтборСтрок = Новый ФиксированнаяСтруктура();
	Иначе
		Элементы.ТаблицаРезультата.ОтборСтрок = Новый ФиксированнаяСтруктура("Обновляемая", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьФактуры(Команда)
	
	Если ЗагрузитьФактурыНаСервере() Тогда
		Состояние("Данные успешно загружены в базу");
	КонецЕсли;
	Элементы.ЗагрузитьФактуры.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьФайл(Команда)
	
	Если НЕ ПустаяСтрока(ПутьКФайлу) Тогда
		ОбработатьВыборФайлаПостроителя();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборФайла()

	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайлаПостроителя", ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение, , , Истина, УникальныйИдентификатор)
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайлаПостроителя(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт	
	
	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
			УстановитьРасширениеРаботыСФайлами();
		КонецЕсли;
	#КонецЕсли	
	
	ПутьКФайлу = ВыбранноеИмяФайла;
	ОбработатьВыборФайлаПостроителя();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайлаПостроителя()
	
	ДанныеФайла = ОбменСПостроителемКлиентСервер.ПрочитатьФайлIni(ПутьКФайлу);
	Если НЕ ДанныеФайла = Неопределено Тогда	
		Элементы.ЗагрузитьФактуры.Доступность = Ложь;
		Если ЗаполнитьТаблицуПоДаннымФайлаНаСервере(ДанныеФайла) Тогда
			Состояние("Данные успешно получены");
			Элементы.ЗагрузитьФактуры.Доступность = Истина;		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТаблицуПоДаннымФайлаНаСервере(ДанныеФайла)
		
	ГруппаНоменклатурыФактур = Константы.ГруппаНоменклатурДляФактуры.Получить();
	Если ГруппаНоменклатурыФактур.Пустая() Тогда
		Сообщить("В настройках программы не указана группа для номенклатуры фактур. Загрузка остановлена");
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаРезультата.Очистить();
	
	Если НЕ ДанныеФайла.Свойство("Материалы") Тогда
		Сообщить("Ошибка чтения полученного файла");
		Возврат Ложь;
	КонецЕсли;
	
	Если ДанныеФайла.Материалы.Количество() > 0 Тогда		
		//подготовим список номенклатуры и итоговую таблицу
		КоличествоСтрок = 0;
		Для Каждого СтрокаINI Из ДанныеФайла.Материалы Цикл
			КоличествоСтрок = КоличествоСтрок + 1;
			Если КоличествоСтрок = 1 Тогда
				НоваяСтрока = ТаблицаРезультата.Добавить();
				НоваяСтрока.Цвет = СокрЛП(СтрокаINI.Представление);
			КонецЕсли;
			Если КоличествоСтрок = 2 Тогда
				НоваяСтрока.Материал = СокрЛП(СтрокаINI.Представление);
			КонецЕсли;
			Если КоличествоСтрок = 3 Тогда
				НоваяСтрока.Каталог = СокрЛП(СтрокаINI.Представление);
			КонецЕсли;
			Если КоличествоСтрок = 4 Тогда
				НоваяСтрока.ШиринаПолотна = СокрЛП(СтрокаINI.Представление);
				КоличествоСтрок = 0;
			КонецЕсли;
		КонецЦикла;				
	КонецЕсли;
	
	РезультатОбработки = Истина;
			
	Для каждого НоваяСтрока из ТаблицаРезультата Цикл
		НоваяСтрока.НаименованиеНоменклатуры = ОбменСEasyCeiling.ПолучитьНаименованиеПленки(НоваяСтрока.Цвет, НоваяСтрока.Материал, НоваяСтрока.ШиринаПолотна);
		
		// проверяем на дубли
		ОтборПоНаименованию = Новый Структура("НаименованиеНоменклатуры", НоваяСтрока.НаименованиеНоменклатуры);
		НайденныеСтроки = ТаблицаРезультата.НайтиСтроки(ОтборПоНаименованию);
		Если НайденныеСтроки.Количество() > 1 Тогда
			Сообщить("Невозможна загрузка фактур: согласно имеющимся правилам формирования наименования пленки происходит дублирование строки """ + 
				НоваяСтрока.НаименованиеНоменклатуры + """. Измените порядок формирования наименования пленки в настройках программы или справочник фактур в программе-построителе!");
			//++ 17144	
			//Возврат Ложь;
			РезультатОбработки = Ложь;
			Продолжить;
			//-- 17144
		КонецЕсли;
		
		// часть таблицы - В базе
		НоваяСтрока.База_Каталог = Справочники.Фактура.НайтиПоНаименованию(НоваяСтрока.Каталог, Истина);
		НоваяСтрока.База_КаталогНоменклатуры = Справочники.Номенклатура.НайтиПоНаименованию(НоваяСтрока.Каталог, Истина);
		//НаименованиеФактуры = НоваяСтрока.Материал + " ("+НоваяСтрока.ШиринаПолотна + ")";
		НоваяСтрока.База_Фактура = Справочники.Фактура.НайтиПоНаименованиюИШирине(НоваяСтрока.Материал, НоваяСтрока.ШиринаПолотна);					
		Если НЕ НоваяСтрока.База_Фактура.Пустая() И НЕ НоваяСтрока.База_Фактура.ЭтоГруппа Тогда
			НоваяСтрока.База_Цвет = Справочники.ЦветФактуры.НайтиПоНаименованию(НоваяСтрока.Цвет, Истина, , НоваяСтрока.База_Фактура);
			Если  ЗначениеЗаполнено(НоваяСтрока.База_Цвет) Тогда
				ЦветОбъект = НоваяСтрока.База_Цвет.ПолучитьОбъект();
				НоваяСтрока.База_НоменклатураЦвета = ЦветОбъект.Номенклатура;
				НоваяСтрока.База_НоменклатураОтличается = НЕ НоваяСтрока.НаименованиеНоменклатуры = ЦветОбъект.Номенклатура.Наименование;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока.Обновляемая = НЕ ЗначениеЗаполнено(НоваяСтрока.База_Фактура) ИЛИ НЕ ЗначениеЗаполнено(НоваяСтрока.База_Цвет) ИЛИ НЕ ЗначениеЗаполнено(НоваяСтрока.База_НоменклатураЦвета);
	КонецЦикла;
										
	Возврат РезультатОбработки;
	
КонецФункции

&НаСервере
Функция ЗагрузитьФактурыНаСервере()
	
	Результат = Истина;
	ТаблицаРезультатаСервер = ДанныеФормыВЗначение(ТаблицаРезультата, Тип("ТаблицаЗначений"));
	
	ПорядокФормированияНаименованияФактуры = Константы.ПорядокФормированияНаименованияФактуры.Получить();
	
	ГруппаНоменклатурыФактур = Константы.ГруппаНоменклатурДляФактуры.Получить();
	Если ГруппаНоменклатурыФактур.Пустая() Тогда
		Сообщить("В настройках программы не указана группа для номенклатуры фактур. Загрузка остановлена");
		Результат = Ложь;
		Возврат Результат;
	КонецЕсли;

	Если ТаблицаРезультатаСервер.Количество() = 0 Тогда
		Сообщить("Отсутствуют данные для загрузки");
		Возврат Ложь;
	КонецЕсли;	
	
	//проверим и создадим "каталоги" - группы фактуры
	ТаблицаКаталогов = ТаблицаРезультатаСервер.Скопировать();
	ТаблицаКаталогов.Свернуть("Каталог, База_Каталог");
	Для Каждого ТекКаталог Из ТаблицаКаталогов Цикл
		Если НЕ ЗначениеЗаполнено(ТекКаталог.База_Каталог) Тогда
			Наименование = СокрЛП(ТекКаталог.Каталог);
			СоздаватьФактуру = Ложь;
			ИскомаяФактура = Справочники.Фактура.НайтиПоНаименованию(Наименование, Истина);
			Если ИскомаяФактура.Пустая() Тогда
				СоздаватьФактуру = Истина;
			ИначеЕсли НЕ ИскомаяФактура.ЭтоГруппа Тогда
				СоздаватьФактуру = Истина;
			КонецЕсли;
			
			Если СоздаватьФактуру Тогда
				Попытка
					ФактураОбъект = Справочники.Фактура.СоздатьГруппу();
					ФактураОбъект.Наименование = СокрЛП(Наименование);
					ФактураОбъект.Записать();
				Исключение
					Сообщить("Ошибка создания группы фактуры """+Наименование+""". "+ОписаниеОшибки());
					Возврат Ложь;
				КонецПопытки
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	//точно так же проверим наличие каталогов для номенклатур цветов Фактуры в справочнике "Номенклатура" и создадим отсутствующие
	ТаблицаКаталогов = ТаблицаРезультатаСервер.Скопировать();
	ТаблицаКаталогов.Свернуть("Каталог, База_КаталогНоменклатуры");
	Для Каждого ТекКаталог Из ТаблицаКаталогов Цикл
		Если НЕ ЗначениеЗаполнено(ТекКаталог.База_КаталогНоменклатуры) Тогда
			Наименование = СокрЛП(ТекКаталог.Каталог);
			СоздаватьКаталог = Ложь;
			ИскомыйКаталог = Справочники.Номенклатура.НайтиПоНаименованию(Наименование, Истина, ГруппаНоменклатурыФактур);
			Если ИскомыйКаталог.Пустая() Тогда
				СоздаватьКаталог = Истина;
			ИначеЕсли НЕ ИскомыйКаталог.ЭтоГруппа Тогда
				СоздаватьКаталог = Истина;
			КонецЕсли;
			
			Если СоздаватьКаталог Тогда
				Попытка
					ГруппаНоменклатуры = Справочники.Номенклатура.СоздатьГруппу();
					ГруппаНоменклатуры.Наименование = СокрЛП(Наименование);
					ГруппаНоменклатуры.Родитель = ГруппаНоменклатурыФактур.Ссылка;
					ГруппаНоменклатуры.Записать();
				Исключение
					Сообщить("Ошибка создания группы номенклатуры """+Наименование+""". "+ОписаниеОшибки());
					Результат = Ложь;
					Возврат Результат;
				КонецПопытки
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
			
	//проверим и создадим "фактуры" - элементы фактуры
	ТаблицаМатериалов = ТаблицаРезультатаСервер.Скопировать();
	ТаблицаМатериалов.Свернуть("Материал, Каталог, ШиринаПолотна, База_Фактура");
	Для Каждого ТекМатериал Из ТаблицаМатериалов Цикл
		Если НЕ ЗначениеЗаполнено(ТекМатериал.База_Фактура) Тогда				
			//Наименование = СокрЛП(ТекМатериал.Материал) + " ("+СокрЛП(ТекМатериал.ШиринаПолотна)+")";
			Наименование = ОбменСEasyCeiling.ПолучитьНаименованиеФактуры(ТекМатериал.Материал, ТекМатериал.ШиринаПолотна, ПорядокФормированияНаименованияФактуры); 
			СоздаватьФактуру = Ложь;
			//ИскомаяФактура = Справочники.Фактура.НайтиПоНаименованию(СокрЛП(Наименование),Истина);
			ИскомаяФактура = Справочники.Фактура.НайтиПоНаименованиюИШирине(СокрЛП(ТекМатериал.Материал), ТекМатериал.ШиринаПолотна);
			ИскомыйРодитель = Справочники.Фактура.НайтиПоНаименованию(СокрЛП(ТекМатериал.Каталог), Истина);
			Если ИскомаяФактура.Пустая() Тогда
				СоздаватьФактуру = Истина;
			ИначеЕсли ИскомаяФактура.ЭтоГруппа Тогда
				СоздаватьФактуру = Истина;
			Иначе
				СоздаватьФактуру = Ложь;
			КонецЕсли;
			
			Если СоздаватьФактуру Тогда
				Попытка
					ФактураОбъект = Справочники.Фактура.СоздатьЭлемент();
					ФактураОбъект.Наименование = СокрЛП(Наименование);
					ФактураОбъект.Родитель = ИскомыйРодитель;
					ФактураОбъект.ШиринаПолотна = ТекМатериал.ШиринаПолотна;
					ФактураОбъект.Каталог = ТекМатериал.Каталог;
					ФактураОбъект.Материал = ТекМатериал.Материал;
					ФактураОбъект.Записать();
				Исключение
					Сообщить("Ошибка создания фактуры """+Наименование+""". "+ОписаниеОшибки());
					Результат = Ложь;
					Возврат Результат;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
		
	//проверим и создадим "цвета" - подчиненные элементам фактура элементы ЦветаФактуры и "Номенклатуру" - соответствующую каждому цвету номенклатуру
	Для Каждого ТекЦвет Из ТаблицаРезультатаСервер Цикл
		Если НЕ ЗначениеЗаполнено(ТекЦвет.База_Цвет) Тогда
			Наименование = СокрЛП(ТекЦвет.Цвет); 
			//НаименованиеВладельца = СокрЛП(ТекЦвет.Материал) + " ("+СокрЛП(ТекЦвет.ШиринаПолотна)+")"; 
			//ИскомыйВладелец = Справочники.Фактура.НайтиПоНаименованию(СокрЛП(НаименованиеВладельца),Истина);
			НаименованиеВладельца = ОбменСEasyCeiling.ПолучитьНаименованиеФактуры(ТекЦвет.Материал, ТекЦвет.ШиринаПолотна, ПорядокФормированияНаименованияФактуры);
			ИскомыйВладелец = Справочники.Фактура.НайтиПоНаименованиюИШирине(СокрЛП(ТекЦвет.Материал), СокрЛП(ТекЦвет.ШиринаПолотна));
			Если НЕ ИскомыйВладелец.Пустая() Тогда
				Если НЕ ИскомыйВладелец.ЭтоГруппа Тогда
					ИскомыйЦвет = Справочники.ЦветФактуры.НайтиПоНаименованию(Наименование, Истина, , ИскомыйВладелец);
					Если ИскомыйЦвет.Пустая() Тогда
						Попытка
							НовыйЦвет = Справочники.ЦветФактуры.СоздатьЭлемент();
							НовыйЦвет.Наименование = Наименование;
							НовыйЦвет.Владелец = ИскомыйВладелец;
							НовыйЦвет.Записать();
							ИскомыйЦвет = НовыйЦвет.Ссылка;
						Исключение
							Сообщить("Ошибка создания цвета """ + Наименование + """. " + ОписаниеОшибки());
							Возврат Ложь;
						КонецПопытки;
					КонецЕсли;
					//проверим и создадим соответствующую номенклатуру
					Если ИскомыйЦвет.Номенклатура.Пустая() Тогда
						НаименованиеНоменклатуры = ОбменСEasyCeiling.ПолучитьНаименованиеПленки(ИскомыйЦвет.Наименование, ИскомыйЦвет.Владелец.Материал, ИскомыйЦвет.Владелец.ШиринаПолотна);
						ГруппаРодительНоменклатуры = Справочники.Номенклатура.НайтиПоНаименованию(СокрЛП(ТекЦвет.Каталог),Истина, ГруппаНоменклатурыФактур);
						Если ГруппаРодительНоменклатуры.Пустая() Тогда
							ГруппаРодительНоменклатуры = ГруппаНоменклатурыФактур.Ссылка;
						КонецЕсли;
						Попытка
							ЭтоНовыйЭлементНоменклатура = Ложь;
							ИскомыйЭлемент = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеНоменклатуры, Истина);
							Если ИскомыйЭлемент.Пустая() Тогда
								НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
								ЭтоНовыйЭлементНоменклатура = Истина;
							Иначе
								НоваяНоменклатура = ИскомыйЭлемент.ПолучитьОбъект();
							КонецЕсли;
							
							НоваяНоменклатура.Наименование = НаименованиеНоменклатуры;
							НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно;
							НоваяНоменклатура.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.МетрКвадратный;
							НоваяНоменклатура.Родитель = ГруппаРодительНоменклатуры.Ссылка;
							НоваяНоменклатура.ШиринаПолотна = ИскомыйЦвет.Владелец.ШиринаПолотна; // №8266
							
							НоваяНоменклатура.Записать();
							ЦветОбъект = ИскомыйЦвет.ПолучитьОбъект();
							ЦветОбъект.Номенклатура = НоваяНоменклатура.Ссылка;
							ЦветОбъект.Записать();
							Если ЭтоНовыйЭлементНоменклатура Тогда
								ЕдИзмАльтернативная = Справочники.ЕдиницыИзмерений.СоздатьЭлемент();
								ЕдИзмАльтернативная.Владелец = НоваяНоменклатура.Ссылка;
								ЕдИзмАльтернативная.Наименование = Справочники.КлассификаторЕдиницИзмерения.МетрПогонный;
								ЕдИзмАльтернативная.Коэффициент = ИскомыйЦвет.Владелец.ШиринаПолотна / 100;
								ЕдИзмАльтернативная.Записать();
								НоваяНоменклатура.АльтернативнаяЕдиницаИзмерения = ЕдИзмАльтернативная.Ссылка;
								НоваяНоменклатура.Записать();
							КонецЕсли;
						Исключение
							Сообщить("Ошибка создания номенклатуры """ + НаименованиеНоменклатуры + """. " + ОписаниеОшибки());
							Результат = Ложь;
							Возврат Результат;
						КонецПопытки;
					КонецЕсли;
				Иначе
					Сообщить("Для цвета """ + Наименование + """ определен владелец """+ИскомыйВладелец+""", который является группой. Должен быть элемент. Проверьте отсутствия одинаковых наименований у фактур и каталогов в Easy Ceiling");
					Результат = Ложь;
					Возврат Результат;
				КонецЕсли;
			Иначе
				Сообщить("Для цвета """+Наименование+""" не удалось найти фактуру """+НаименованиеВладельца+"""");
				Результат = Ложь;
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
